import React from 'react';

const Blogs = () => {
  return (
    <div className='md:px-8'>
      {/* <h1 className="text-center text-accent font-bold md:text-4xl my-8 sm:text-3xl text-2xl">QUESTION_BLOGS</h1> */}
      <div className="grid grid-cols-1 lg:grid-cols-2 gap-8 my-6">
        <div className='shadow-xl sm:p-6 p-4  rounded-lg'>
          <h1 className="text-2xl font-semibold text-accent text-left leading-9 pb-2">কিভাবে একটি প্রতিক্রিয়া(react) অ্যাপ্লিকেশনের কর্মক্ষমতা উন্নত করব</h1>
          <p className="text-md font-medium text-gray-600 leading-7 text-left">
            ফাংশন/স্টেটলেস কম্পোনেন্ট এবং রিঅ্যাক্ট পিউর কম্পোনেন্ট ব্যবহার করা।
            অতিরিক্ত HTML এলিমেন্ট র‍্যাপার এড়াতে React.Fragments ব্যবহার করা। যেখানে প্রয়োজন সেখানে উপাদানের অবস্থা স্থানীয় রাখা। রেন্ডার ফাংশনে ইনলাইন ফাংশন সংজ্ঞা এড়িয়ে চলা। অপ্রয়োজনীয় রি-রেন্ডার প্রতিরোধ করার জন্য প্রতিক্রিয়া উপাদানগুলি স্মরণ করা।
          </p>
        </div>
        <div className='shadow-xl sm:p-6 p-4  rounded-lg'>
          <h1 className="text-2xl font-semibold text-accent text-left leading-9 pb-2">
            একটি প্রতিক্রিয়া(react) অ্যাপ্লিকেশনে একটি রাষ্ট্র পরিচালনা করার বিভিন্ন উপায় কি কি?
          </h1>
          <p className="text-md font-medium text-gray-600 leading-7 text-left">
            প্রতিক্রিয়া(react) অ্যাপগুলিতে আপনাকে সঠিকভাবে পরিচালনা করার জন্য চারটি প্রধান ধরণের রাষ্ট্র রয়েছে: স্থানীয় রাষ্ট্র(Local state),বিশ্বব্যাপী রাষ্ট্র(Global state) ,সার্ভারের অবস্থা(Server state),URL অবস্থা(URL state)। স্থানীয় রাষ্ট্র(Local state) প্রায়শই useState হুক ব্যবহার করে প্রতিক্রিয়াতে পরিচালিত হয়। গ্লোবাল স্টেট(Global state) হল ডেটা যা আমরা একাধিক উপাদান জুড়ে পরিচালনা করি। সার্ভার স্টেট একটি সাধারণ ধারণা, কিন্তু আমাদের সমস্ত স্থানীয় এবং বিশ্বব্যাপী UI অবস্থার পাশাপাশি পরিচালনা করা কঠিন হতে পারে। পাথনাম এবং ক্যোয়ারী প্যারামিটার সহ আমাদের URL-এ বিদ্যমান ডেটা।
          </p>
        </div>
        <div className='shadow-xl sm:p-6 p-4  rounded-lg'>
          <h1 className="text-2xl font-semibold text-accent text-left leading-9 pb-2">প্রোটোটাইপিকাল উত্তরাধিকার(prototypical inheritance ) কিভাবে কাজ করে?</h1>
          <p className="text-md font-medium text-gray-600 leading-7 text-left">
            প্রোটোটাইপ্যাল ​​ইনহেরিট্যান্স হল জাভাস্ক্রিপ্টের একটি বৈশিষ্ট্য যা বস্তুতে পদ্ধতি এবং বৈশিষ্ট্য যোগ করতে ব্যবহৃত হয়। এটি এমন একটি পদ্ধতি যার মাধ্যমে একটি বস্তু অন্য বস্তুর বৈশিষ্ট্য এবং পদ্ধতির উত্তরাধিকারী হতে পারে। প্রোটোটাইপিকাল উত্তরাধিকার অন্য বস্তু থেকে বস্তুর বৈশিষ্ট্য অ্যাক্সেস করার ক্ষমতা বোঝায়। বিদ্যমান অবজেক্ট কনস্ট্রাক্টরে নতুন বৈশিষ্ট্য এবং পদ্ধতি যোগ করতে আমরা একটি জাভাস্ক্রিপ্ট প্রোটোটাইপ ব্যবহার করি। আমরা তখন মূলত আমাদের JS কোডকে একটি প্রোটোটাইপ থেকে সম্পত্তির উত্তরাধিকারী হতে বলতে পারি। প্রোটোটাইপিকাল ইনহেরিটেন্স আমাদেরকে একটি রেফারেন্স পয়েন্টার ফাংশনের মাধ্যমে একটি জাভাস্ক্রিপ্ট অবজেক্ট থেকে অন্যটিতে বৈশিষ্ট্য বা পদ্ধতিগুলিকে পুনরায় ব্যবহার করতে দেয়।।
          </p>
        </div>
        <div className='shadow-xl sm:p-6 p-4  rounded-lg'>
          <h1 className="text-2xl font-semibold text-accent text-left leading-9 pb-2"> কেন আপনি স্টেট সেট করবেন না সরাসরি React এ।</h1>
          <p className="text-md font-medium text-gray-600 leading-7 text-left">
            নিম্নলিখিত কারণগুলির কারণে একজনকে কখনই সরাসরি রাষ্ট্র আপডেট করা উচিত নয়:
            আপনি যদি এটি সরাসরি আপডেট করেন, তাহলে setState() কে পরে কল করলে আপনার করা আপডেটটি বদলে যেতে পারে। আপনি যখন রাজ্যকে সরাসরি আপডেট করেন, তখন এটি অবিলম্বে this.state পরিবর্তন করে না। পরিবর্তে, এটি একটি মুলতুবি অবস্থার রূপান্তর তৈরি করে, এবং এই পদ্ধতিতে কল করার পরে এটি অ্যাক্সেস করা শুধুমাত্র বর্তমান মান ফিরিয়ে দেবে। আপনি সমস্ত উপাদান জুড়ে রাষ্ট্র নিয়ন্ত্রণ হারাবেন ।</p>
        </div>
        <div className='shadow-xl sm:p-6 p-4  rounded-lg'>
          <h1 className="text-2xl font-semibold text-accent text-left leading-9 pb-2">একটি ইউনিট পরীক্ষা কি? কেন ইউনিট পরীক্ষা লিখতে হবে?</h1>
          <p className="text-md font-medium text-gray-600 leading-7 text-left">
            কম্পিউটার প্রোগ্রামিং-এ, ইউনিট টেস্টিং হল একটি সফ্টওয়্যার টেস্টিং পদ্ধতি যার মাধ্যমে সোর্স কোডের পৃথক একক-সংশ্লিষ্ট নিয়ন্ত্রণ ডেটা, ব্যবহার পদ্ধতি । অপারেটিং পদ্ধতিগুলির সাথে এক বা একাধিক কম্পিউটার প্রোগ্রাম মডিউলের সেটগুলি-সেগুলি আমাদের জন্য উপযুক্ত কিনা তা নির্ধারণ করতে পরীক্ষা করা হয়। ইউনিট টেস্টিং সফ্টওয়্যার বিকাশকারীদের সফ্টওয়্যারটির ডিজাইনের মাধ্যমে এবং কোড লেখার আগে তাদের কী করা উচিত তা চিন্তা করার অনুমতি দেয়। এটি তাদের দৃষ্টি নিবদ্ধ রাখতে সাহায্য করতে পারে এবং আরও ভাল ডিজাইন তৈরি করতে সাহায্য করতে পারে।</p>
        </div>
      </div>
    </div>
  );
};

export default Blogs;